In [31]:
import pandas as pd 
from datasets import load_dataset
import matplotlib.pyplot as plt

# loading datasets
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [32]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [33]:
# to get the median that will replace missing values
df['salary_year_avg'].median()

# then set this into a variable
median_salary_year = df['salary_year_avg'].median()

In [36]:
df['salary_hour_avg'].median()

# then set this into a variable
median_salary_hour = df['salary_hour_avg'].median()

In [38]:
median_salary_hour

45.97999954223633

In [39]:
# now duplicate the sheet and fill 
df_filled = df

In [43]:
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

df_filled['salary_hour_avg']

0         45.98
1         45.98
2         45.98
3         45.98
4         45.98
          ...
785736    45.98
785737    45.98
785738    45.98
785739    45.98
785740    45.98
Name: salary_hour_avg, Length: 785741, dtype: float64

In [44]:
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)

In [45]:
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [46]:
df_filled.loc[:, 'salary_year_avg':'salary_hour_avg']

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [48]:
df_filled.loc[0:30, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98
11         115000.0            45.98
12         115000.0            45.98
13         115000.0            45.98
14         115000.0            45.98
15         115000.0            45.98
16         115000.0            45.98
17         115000.0            45.98
18         115000.0            45.98
19         115000.0            45.98
20         115000.0            45.98
21         115000.0            45.98
22         115000.0            45.98
23         115000.0            45.98
24         115000.0            45.98
25         115000.0            45.98
26         115000.0            45.98
27         115000.0            45.98
28         109500.0            45.98
29         115000.0            45.98
30         115000.0            45.98

In [52]:
# to remove duplicates values
df_unique = df_filled

df_unique.drop_duplicates()

print('length of original values:    ', len(df_filled))
print('length of drop duplicates df:    ', len(df_unique))
print('rows dropped:    ', len(df_filled) - len(df_unique))

length of original values:     785741
length of drop duplicates df:     785741
rows dropped:     0

In [53]:
df_unique = df_unique.drop_duplicates()

print('length of original values:    ', len(df_filled))
print('length of drop duplicates df:    ', len(df_unique))
print('rows dropped:    ', len(df_filled) - len(df_unique))

length of original values:     785741
length of drop duplicates df:     785640
rows dropped:     101

In [56]:
df.unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

print('length of original values:    ', len(df_filled))
print('length of drop duplicates df:    ', len(df_unique))
print('rows dropped:    ', len(df_filled) - len(df_unique))

length of original values:     785741
length of drop duplicates df:     785640
rows dropped:     101